In [3]:
%load_ext sql

In [4]:
%sql mysql+pymysql://root:easwari@localhost

In [5]:
%%sql
use joins;

 * mysql+pymysql://root:***@localhost
0 rows affected.

[]

In [6]:
%%sql
select * from employees;

 * mysql+pymysql://root:***@localhost
5 rows affected.

[(1, 'sanjay'), (2, 'lavanya'), (3, 'jaanu'), (4, 'lakshith'), (5, 'Keerthu')]

--> inorder to use {commit} and {rollback} we need to off the {autocommit}

--> because mysql save every transaction (query) after it is executed

--> inorder to {save} only the {specific changes} we need to {off} the {autocommit} and use {commit} to {save} the changes we want

In [7]:
%%sql
set autocommit =0;

 * mysql+pymysql://root:***@localhost
0 rows affected.

[]

In [8]:
%%sql
update employees
set emp_name = 'sanjana'
where emp_no = 5;

 * mysql+pymysql://root:***@localhost
1 rows affected.

[]

In [9]:
%%sql
select * from employees;

 * mysql+pymysql://root:***@localhost
5 rows affected.

[(1, 'sanjay'), (2, 'lavanya'), (3, 'jaanu'), (4, 'lakshith'), (5, 'sanjana')]

--> here im save the changes by using commit

In [10]:
%%sql
commit;

 * mysql+pymysql://root:***@localhost
0 rows affected.

[]

In [11]:
%%sql
select * from employees;

 * mysql+pymysql://root:***@localhost
5 rows affected.

[(1, 'sanjay'), (2, 'lavanya'), (3, 'jaanu'), (4, 'lakshith'), (5, 'sanjana')]

In [12]:
%%sql
update employees
set emp_name = 'Keerthu'
where emp_no = 5;

 * mysql+pymysql://root:***@localhost
1 rows affected.

[]

In [13]:
%%sql
select * from employees;

 * mysql+pymysql://root:***@localhost
5 rows affected.

[(1, 'sanjay'), (2, 'lavanya'), (3, 'jaanu'), (4, 'lakshith'), (5, 'Keerthu')]

--> rollback will retrieve the last commit(saved) changes

--> so now the {name become sanjana} for {employee_number-->5}

In [14]:
%%sql
rollback;

 * mysql+pymysql://root:***@localhost
0 rows affected.

[]

In [16]:
%%sql
select * from employees;

 * mysql+pymysql://root:***@localhost
5 rows affected.

[(1, 'sanjay'), (2, 'lavanya'), (3, 'jaanu'), (4, 'lakshith'), (5, 'sanjana')]